simpleFoam/campagneUniformG0Rotation/H045C/D050L474W005G000H045V015_C/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "startBC/initialConditions"

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform ($inletVelocity 0 0);

boundaryField
{
    bottom
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
