simpleFoam/campagneUniformG0Rotation/H045C/D050L474W005G000H045V015_C/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "startBC/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaHighRe;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }

    "(bottom|frontAndBack)"
    {
        type            omegaWallFunction;
        value           uniform $omegaHighRe;
		//kn              8e-4;
    }

    "(cylinder)"
    {
        type            omegaWallFunction;
        value           uniform $omegaLowRe;
		//kn              8e-4;
    }
}


// ************************************************************************* //
